gcc -g p1original.c
p1original.c: In function ‘output’:
p1original.c:14:10: warning: too many arguments for format [-Wformat-extra-args]
   printf("the sum of %d%d",a,b,sum);
          ^~~~~~~~~~~~~~~~~
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x7fc: file p3original.c, line 17.
(gdb) l
3   int input(int *pa, int *pb)
4   {
5     printf("enter two numbers\n");
6     scanf("%d%d",pa,pb);
7   }
8   int add(int a,int b,int*sum)
9   {
10    *sum=a+b;
11  }
12  int output(int a,int b,int sum)
(gdb) r
Starting program: /home/runner/test4-iam-nivi-3/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p3original.c:17
17  {
(gdb) n
19    input(&a,&b);
(gdb) n
enter two numbers
55
77
20    add(a,b,&c);
(gdb) n
21    output(a,b,c);
(gdb) n
22    return 0;
(gdb) s
23  }
(gdb) c
Continuing.
the sum of 5577[Inferior 1 (process 50) exited normally]
(gdb) f
No stack.
(gdb) 