gcc -g p7original.c
îº§ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x858: file p7original.c, line 33.
(gdb) l
19  {
20    struct complex c;
21    c.real = a.real + b.real;
22    c.imaginary=a.imaginary + b.imaginary;
23    return c;
24  }
25
26  void output(Complex a,Complex b,Complex c)
27  {
28  printf("sum of complex number is %f + i%f\n",c.real,c.imaginary);
(gdb) r
Starting program: /home/runner/test4-iam-nivi-3/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p7original.c:33
33    a=input_complex();
(gdb) n
Enter the complex
-^7
34    b=input_complex();
(gdb) n
Enter the complex
35    c = add(a,b);
(gdb) n
36    output(a,b,c);
(gdb) n
sum of complex number is -50494865408.000000 + i0.000000
37    return 0;
(gdb) c
Continuing.
[Inferior 1 (process 54) exited normally]
(gdb) 
